Revit 2024 API
Extrusion.EndOffset Property
The offset of the end of the extrusion relative to the sketch plane.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public double EndOffset { get; set; }
Visual Basic
Public Property EndOffset As Double
	Get
	Set
Visual C++
public:
property double EndOffset {
	double get ();
	void set (double value);
}
Remarks
The direction of the offset is based on the normal of the extrusion's sketch plane: a positive value is in the direction of the normal, a negative value is in the other direction.
See Also
Extrusion Class
Autodesk.Revit.DB Namespace